results/springboot-optimal/r6id.xlarge/wrk2.log
===== Spring Boot Benchmark (wrk) =====
Instance Type: r6id.xlarge
Spring Boot Host: springboot-server-r6id-xlarge

--- Warm-up Phase (30s) ---
Warm-up complete

--- Main Page - 2 threads, 50 connections, 60s ---
Running 1m test @ http://springboot-server-r6id-xlarge:8080/
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.24ms  361.38us  21.73ms   82.98%
    Req/Sec    20.00k   801.81    22.02k    68.92%
  Latency Distribution
     50%    1.19ms
     75%    1.36ms
     90%    1.58ms
     99%    2.40ms
  2388084 requests in 1.00m, 319.28MB read
Requests/sec:  39798.45
Transfer/sec:      5.32MB

--- Main Page - 2 threads, 100 connections, 60s ---
Running 1m test @ http://springboot-server-r6id-xlarge:8080/
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.23ms  561.38us  20.79ms   77.16%
    Req/Sec    22.21k     0.93k   25.03k    71.17%
  Latency Distribution
     50%    2.15ms
     75%    2.46ms
     90%    2.90ms
     99%    4.03ms
  2652092 requests in 1.00m, 354.57MB read
Requests/sec:  44155.99
Transfer/sec:      5.90MB

--- High Load - 2 threads, 200 connections, 30s ---
Running 30s test @ http://springboot-server-r6id-xlarge:8080/
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.42ms    1.13ms  35.77ms   78.51%
    Req/Sec    22.61k     1.07k   25.19k    70.57%
  Latency Distribution
     50%    4.31ms
     75%    4.83ms
     90%    5.69ms
     99%    7.97ms
  1344923 requests in 30.03s, 179.81MB read
Requests/sec:  44783.12
Transfer/sec:      5.99MB

===== Spring Boot Benchmark Complete =====